{
  "slug": "language-learning-app",
  "name": "Learn Lingo",
  "type": "web-app",
  "role": "Full-Stack Developer",
  "status": "completed",
  "releasedAt": "2024-08-31",
  "links": {
    "live": "https://yurii-corssa.github.io/language-learning-app/",
    "frontend": "https://github.com/yurii-corssa/language-learning-app",
    "backend": null,
    "design": "https://www.figma.com/design/dewf5jVviSTuWMMyU3d8Mc/Learn-Lingo?node-id=0-1"
  },
  "media": {
    "cover": {
      "1x": "https://raw.githubusercontent.com/yurii-corssa/aperture/main/src/assets/learn-lingo-preview.jpg",
      "2x": null,
      "3x": null
    },
    "liveDemo": null
  },
  "descriptions": {
    "ua": {
      "short": "Веб-додаток для пошуку та бронювання викладачів іноземних мов з реєстрацією, фільтрами, обраними та адаптивним інтерфейсом.",
      "full": "Learn Lingo це веб-додаток, створений для демонстрації навичок фронтенд та фулстек розробки шляхом реалізації сучасної платформи для пошуку та бронювання викладачів іноземних мов. Основна мета проєкту надати користувачам зручний сервіс для пошуку, фільтрації та бронювання занять, а також забезпечити безпечну автентифікацію та персоналізовані функції, такі як обране. Розробка здійснювалася з дотриманням найкращих практик: модульна архітектура, використання реюзабельних компонентів і ефективне управління станом для підтримки масштабованості та легкості супроводу. Інтерфейс реалізовано за допомогою Styled Components і Framer Motion, що забезпечує сучасний вигляд і плавну анімацію, а React Router швидку навігацію. Особливу увагу приділено адаптивності та доступності, що гарантує стабільну роботу на різних пристроях. Серед ключових функцій динамічні профілі викладачів, розширена фільтрація, форми бронювання, модальні вікна автентифікації та миттєві сповіщення. Важливими деталями реалізації стали інтеграція з Firebase для автентифікації та зберігання даних, а також використання кастомних хуків і контекстів для оптимального управління станом. Learn Lingo це надійний, продуктивний додаток, що демонструє володіння сучасними вебтехнологіями та є цінним елементом портфоліо, підкреслюючи орієнтацію на зручність, адаптивність і якість коду.",
      "resume": "Індивідуальний проєкт, спрямований на створення функціонального сервісу для пошуку та бронювання викладачів іноземних мов. Реалізовано автентифікацію, обране, фільтрацію, бронювання та адаптивний інтерфейс. Додаток оптимізовано для зручності використання та продуктивності на всіх пристроях."
    },
    "en": {
      "short": "A web app for finding and booking language teachers with authentication, favorites, filtering, booking, and responsive UI.",
      "full": "Learn Lingo is a web application designed to showcase advanced front-end and full-stack development skills through the creation of a modern platform for finding and booking language teachers. The project’s primary goal was to deliver a user-centric product that streamlines the process of searching, filtering, and reserving lessons, while also providing secure authentication and personalized features such as favorites. Development focused on best practices including modular architecture, reusable components, and state management to ensure maintainability and scalability. The UI was crafted with Styled Components and Framer Motion for a visually appealing, interactive experience, while React Router enabled seamless navigation. Special attention was given to accessibility and responsiveness, guaranteeing optimal performance across devices. Key features include dynamic teacher profiles, advanced filtering, booking forms, authentication modals, and real-time feedback via toast notifications. Notable implementation details include integration with Firebase for authentication and data management, as well as custom hooks and context providers for efficient state handling. The result is a robust, high-performance application that demonstrates proficiency in modern web technologies. Learn Lingo stands out as a portfolio piece, reflecting a commitment to usability, responsive design, and code quality.",
      "resume": "Individual project focused on building a functional service for searching and booking language teachers. Implemented authentication, favorites, filtering, booking, and adaptive UI. Delivered a responsive, user-friendly app optimized for usability and performance."
    }
  },
  "techStack": {
    "core": ["React", "Firebase", "Styled Components", "Framer Motion", "Vite"],
    "tools": ["React Router", "yup", "react-hook-form", "ESLint", "npm", "Netlify"]
  },
  "tags": ["full-stack", "react", "firebase", "web-app"]
}
