{
  "slug": "language-learning-app",
  "name": "Learn Lingo",
  "type": "web-app",
  "role": "Fullstack Developer",
  "status": "completed",
  "releasedAt": "2024-08-31",
  "links": {
    "live": "https://yurii-corssa.github.io/language-learning-app/",
    "frontend": "https://github.com/yurii-corssa/language-learning-app",
    "backend": null,
    "design": "https://www.figma.com/design/dewf5jVviSTuWMMyU3d8Mc/Learn-Lingo?node-id=0-1"
  },
  "media": {
    "cover": {
      "1x": "https://raw.githubusercontent.com/yurii-corssa/aperture/main/src/assets/learn-lingo-preview.jpg",
      "2x": null,
      "3x": null
    },
    "liveDemo": null
  },
  "descriptions": {
    "ua": {
      "short": "Розроблений як портфоліо-проєкт, цей веб-додаток дає змогу шукати й бронювати викладачів мов, має автентифікацію, фільтри та адаптивний дизайн. Забезпечує зручність і демонструє впевнені full-stack навички",
      "full": "Learn Lingo це веб-додаток, створений для демонстрації навичок full-stack розробки шляхом реалізації сучасної платформи для пошуку та бронювання викладачів іноземних мов. Проєкт виконано індивідуально з акцентом на зручність і продуктивність: реалізовано безпечну автентифікацію (включно з Google), розширений пошук і фільтрацію викладачів, управління обраними та простий процес бронювання занять. Додаток побудовано на React і Firebase, має адаптивний дизайн і плавні анімації для комфортної роботи на будь-яких пристроях. Модульна архітектура та сучасні підходи забезпечують легкість підтримки й масштабування. Результатом став надійний, швидкий і зручний сервіс, що підкреслює технічну майстерність і орієнтацію на користувача і є вагомим портфоліо-проєктом.",
      "resume": "Індивідуальний проєкт, спрямований на створення функціонального сервісу для пошуку та бронювання викладачів іноземних мов. Реалізовано автентифікацію, обране, фільтрацію, бронювання та адаптивний інтерфейс. Додаток оптимізовано для зручності використання та продуктивності на всіх пристроях."
    },
    "en": {
      "short": "Developed as a portfolio project, this web app allows users to search for and book language teachers, featuring secure authentication, filtering, and responsive design. Delivers a user-friendly experience and demonstrates strong full-stack skills.",
      "full": "Learn Lingo is a web application created to demonstrate full-stack development expertise by delivering a modern platform for searching and booking language teachers. Developed individually, the project emphasizes usability and performance, featuring secure authentication (including Google sign-in), advanced teacher search and filtering, favorites management, and a seamless lesson booking process. The app leverages React and Firebase, with adaptive design and smooth animations for an engaging user experience across all devices. Modular architecture and best practices ensure maintainability and scalability. The result is a robust, responsive, and user-friendly service that highlights both technical proficiency and a focus on real-world usability, making it a valuable addition to my portfolio.",
      "resume": "Individual project focused on building a functional service for searching and booking language teachers. Implemented authentication, favorites, filtering, booking, and adaptive UI. Delivered a responsive, user-friendly app optimized for usability and performance."
    }
  },
  "techStack": {
    "core": ["React", "Firebase", "Styled Components", "Framer Motion", "Vite"],
    "tools": ["React Router", "yup", "react-hook-form", "ESLint", "Prettier", "npm"]
  },
  "tags": ["full-stack", "react", "firebase", "web-app"]
}
